1：常用API->日历类Calendar

	抽象类
	
2：常用的API->基本数据类型对象的包装类

	基本数据只能记性判断、相加、相减等操作
	
	程序的用户输入的数据都是以字符串的类型进行存储的。而程序的开发过程当中需要我们把字符串
	数据，根据需求转换为指定的基本数据类型。如：年龄需要我们转换成int类型，55岁。想要实现
	字符串与基本类型进行转换怎么办？
	
	Java中提供了相对应的对象来解决这个问题。基本数据类型的包装类。java中将基本的数据类型
	封装成了对象。好处？可以提供更多操作基本数值的功能。
	
	八种基本类型对应的包装类：
	
		字节型：  byte -> Byte
		短整型：  short -> Short
		整数： int -> Integer
		长整型：long -> Long
		字符型： char -> Charactor
		布尔型： boolean -> Boolean
		浮点型：float -> Float
		浮点型：double -> Double
		
3；常用API->Integer类

4：常用API->自动装箱与自动拆箱

