1：基础语法->ASCII编码表

	计算机的世界,01->二进制.
	
	全世界有多少个国家？每个国家用什么语言？  全世界都在使用计算机。
	
	美国：计算机可以直接识别人类的文字
	
	字母a对应的十进制为97，大写的字母A对应的十进制是65
	
	美国佬：a-z A-Z 0-9 !@#$%等
	
	a->在硬盘当中存储并不是a，是a对应值97的二进制
	
	常用的ASCII编码表：
		数字0-9对应的ASCII编码十进制为48-57 ,字母a-z对应的是97-122,字母A-Z对应的
		65-90
		
	中国：开始做自己的编码表
		  让十进制数，对应一个汉字
		  简体中文编码 GB2312-》国标 对应的汉字比较少
					   升级为GBK
	
	万国码，国际标准ISO（全球所有的语言兼容ASCII编码表）Unicode
	
2：基础语法->char类型的存储

	java中字符，数据类型 char
	java中整数，数据类型 int
	
3：工具的使用：eclipse idea netbeans

	优点：免费、无版权，随便用。开源（eclipse的源码对外开放）、可下载插件（拓展性强）、
		绿色版软件->解压即可使用
		
4：eclipse快捷键：
	alt+/  自动补全
	Ctrl+/ 单行注释 取消单行注释
	Ctrl+Shift+/ 多行注释
	Ctrl+Shift+\ 取消多行注释
	Ctrl+Shift+o 导入包选中的行
	Alt+上下箭头 移动这行代码
	Ctrl+D 删除当前行
	
	Ctrl+1 查看提示
	Ctrl+2 r 统一改名
	Ctrl+2 l 接收返回值
	
	